{"posts":[{"title":"ANACONDA COMMAND","text":"Anaconda Prompt OperationCreate new environmentconda create —name environment pakage conda create —name python3 python=3.8 Activate environmentconda activate environment Exit environmentdeactivate environment Delete environmentconda remove -n environment —all Copy environmentconda create -n environment —clone existing_environment View environment informationconda info -econda env listconda info —envs View python versionpython -V # Install packageconda install package View package informationconda search package Install package in a specify environmentconda install -n environment package Update package in a specify environmentconda update -n environment package Delete package in a specify environmentconda remove -n environment package View the installed packages in the current environmentconda list View the installed packages in a specify environmentconda list -n environment","link":"/2023/01/12/ANACONDA%20COMMAND/"},{"title":"Introduction to Plasma","text":"Introduction to PlasmaOur Universe is made of 69% dark energy, 27% dark matter, 1% normal matter. What is plasma?Plasma is also called the “fourth state of matter”. Solid is heated to became a liquid, liquid is heated to became a gas.Upon further heating, the gas is ionized into a plasma. Since plasma usually exists only in a vacuum, we need to pump the air out of a vacuum chamber in the laboratory. The Definition of Plasma A plasma is a quasineutral gas of charged and neutral particles which exhibits collective behavior. The Saha Equation1\\frac{n_i}{n_n} \\approx 2.4 \\times 10^{21} \\frac{T^{3/2}{n_i}e^{-U_i/KT} 1n_i\\ is\\ the\\ density\\ of\\ ionized\\ atoms 1n_n\\ is\\ the\\ density\\ of\\ neutral\\ atoms 1K\\ is\\ Boltzmann's\\ constant 1U_i\\ is\\ the\\ ionization\\ energy\\ of\\ the\\ gas Physical meaning When temperature is raising, the whole value is increasing exponentially with U~i~/KT The lower value of n~i~, the lower recombination rate of ionized atoms","link":"/2023/01/12/Introduction%20to%20Plasma/"}],"tags":[],"categories":[{"name":"PLASMA","slug":"PLASMA","link":"/categories/PLASMA/"},{"name":"OPENCV","slug":"OPENCV","link":"/categories/OPENCV/"}],"pages":[]}