{"posts":[{"title":"Introduction to Plasma","text":"Our Universe is made of 69% dark energy, 27% dark matter, 1% normal matter. What is plasma?Plasma is also called the “fourth state of matter”. Solid is heated to become a liquid, liquid is heated to become a gas.Upon further heating, the gas is ionized into a plasma. Since plasma usually exists only in a vacuum, we need to pump the air out of a vacuum chamber in the laboratory. The Definition of Plasma A plasma is a quasineutral gas of charged and neutral particles which exhibits collective behavior. The Coulomb force between A and B diminishes as 1/r^2. However, for a given solid angle($\\Delta$r/r = constant), the volume of plasma in B that can affect A increases as r^3. The Saha Equation\\frac{n_i}{n_n}\\approx2.4\\times10^{21}\\frac{T^{3/2}}{n_i}e^{-U_i/KT}n_i\\ is\\ the\\ density\\ of\\ ionized\\ atomsn_n\\ is\\ the\\ density\\ of\\ neutral\\ atomsK\\ is\\ Boltzmann's\\ constantU_i\\ is\\ the\\ ionization\\ energy\\ of\\ the\\ gasPhysical meaning When temperature is raising, the whole value is increasing exponentially with U_i/KT. The higher value of n_i, the lower recombination rate of ionized atoms. The Maxwellian DistributionThe one-dimensional Maxwellian distributionf(u)=Aexp(-\\frac{1}{2}mu^2/KT)fdu\\ is\\ the\\ number\\ of\\ particles\\ per\\ m^3\\ with\\ velocity\\ between\\ u\\ and\\ u+du\\frac{1}{2}mu^2\\ is\\ the\\ kinetic\\ energyBoltzmann’s constant KK=1.38\\times10^{-23}J/^{\\circ}KThe particles density nn=\\int_{-\\infty}^{\\infty}f(u)duThe constant A is related to the density nA=n(\\frac{m}{2\\pi KT})^{1/2} The average kinetic energy is $\\frac{1}{2}KT$ The three-dimensional Maxwellian distributionf(u,v,w)=A_3exp[-\\frac{1}{2}m(u^2+v^2+w^2)/KT] Reference BookIntroduction to Plasma Physics and Controlled Fusion by Francis F. Chen","link":"/2023/01/12/Introduction%20to%20Plasma/"},{"title":"Single Particle Motions","text":"Uniform E and B Fields The conditions: E = 0 The equation of motionm\\frac{dv}{dt}=q\\mathbf{v}\\times\\mathbf{B}Cyclotron frequency\\omega_c\\equiv\\frac{\\lvert q\\rvert\\mathbf{B}}{m} v_x=v_\\perp e^{i\\omega_c t}v_y=\\pm iv_\\perp e^{i\\omega_c t} combine The Larmor radiusr_L\\equiv\\frac{v_\\perp}{\\omega_c}=\\frac{mv_\\perp}{\\lvert q\\rvert\\mathbf{B}}we get x-x_0=r_Lsin\\omega_c ty-y_0=\\pm r_L cos\\omega_c t guiding center (x_0, y_0) plasmas are diamagnetic The conditions: finite E The equation of motionm\\frac{d\\mathbf v}{dt}=q(\\mathbf E+\\mathbf v\\times\\mathbf B) v_x=v_\\perp e^{i\\omega_c t}v_y=\\pm iv_\\perp e^{i\\omega_c t}-\\frac{\\mathbf E_x}{\\mathbf B} The usual circular Larmor gyration A drift of the guiding center The three-dimensional orbit in space is therefore a slanted helix with changing pitch. The conditions: gravitational field \\mathbf v_g=\\frac{m}{q}\\frac{\\mathbf g\\times\\mathbf B}{\\mathbf B^2} The magnitude of v_g is usually negligible But an effective gravitational force due to centrifugal force is not negligible Reference BookIntroduction to Plasma Physics and Controlled Fusion by Francis F. Chen","link":"/2023/01/12/Single%20Particle%20Motions/"},{"title":"Anaconda Command","text":"Anaconda Prompt OperationCreate new environment conda create - -name environment pakage conda create - -name python3 python=3.8 Activate environment conda activate environment Exit environment deactivate environment Delete environment conda remove -n environment - -all Copy environment conda create -n environment - -clone existing_environment View environment information conda info -econda env listconda info - -envs View python version python -V Install package conda install package View package information conda search package Install package in a specify environment conda install -n environment package Update package in a specify environment conda update -n environment package Delete package in a specify environment conda remove -n environment package View the installed packages in the current environment conda list View the installed packages in a specify environment conda list -n environment","link":"/2023/01/12/Anaconda%20Command/"},{"title":"Image Formation","text":"2D points\\mathbf x=(x,y)\\in\\textit R^2\\mathbf x=\\begin{bmatrix} x \\\\ y \\end{bmatrix}homogeneous vector \\mathbf{\\tilde x}\\mathbf{\\tilde x}=(\\tilde x,\\tilde y,\\tilde w)\\in\\textit P^2 2D projective space \\textit P^2=\\textit R^3-(0,0,0) inhomogeneous vector \\mathbf{\\overline x}\\mathbf{\\tilde x}=\\tilde w(x,y,1)=\\tilde w\\mathbf{\\overline x} Reference BookComputer Vision: Algorithms and Applications by Richard Szeliski","link":"/2023/01/13/Image%20Formation/"},{"title":"GNN Paper","text":"Review Graph Neural Networks: A Review of Methods and Applications Deep Learning on Graphs: A Survey Relationanl Inductive Biases, Deep Learning, and Graph Neural Networks Geometric Deep Learning: Going beyond Euclidean data Computational Capabilities of Graph Neural Networks Neural Message Passing for Quantum Chemistry Non-local Neural Networks The Graph Neural Network Model ModelApplication","link":"/2023/01/14/GNN%20Paper/"},{"title":"Graph Neural Networks - A Review of Methods and Applications","text":"AbstractGraph neural networks are neural models that capture the dependence of graphs via message passing between the nodes of graphs. propose a general design pipeline for GNN models discuss the variants of each component systematically categorize the applications propose four open problems for future research IntroductionGraphs can be used across various areas social networks Graph Convolutional Networks with Markov Random Field Reasoning for Social Spammer Detection natural science Graph Networks as Learnable Physics Engines for Inference and Control Interaction Networks for Learning about Objects, Relations and Physics protein-protein interaction networks Protein Interface Prediction using Graph Convolutional Networks knowledge graphs Knowledge Transfer for Out-of-Knowledge-Base Entities: A Graph Neural Network Approach other research areas Learning Combinatorial Optimization Algorithms over Graphs","link":"/2023/01/14/Graph%20Neural%20Networks%20-%20A%20Review%20of%20Methods%20and%20Applications/"}],"tags":[],"categories":[{"name":"PLASMA","slug":"PLASMA","link":"/categories/PLASMA/"},{"name":"CV","slug":"CV","link":"/categories/CV/"}],"pages":[]}